{
	"status": "OK",
	"dataList": {
		"article_list": [
			{
				"id": 1,
				"title": "男人害怕失去你，才会这么“折磨”你",
				"content": "<p>爱情是很神奇的，它能让男人和女人成为最亲密的恋人，也能彻底改变一个人。</p><p>单身的时候，都认为自己是最优秀的，不比任何人差，对另一半的要求是很高的。可当碰到了喜欢的人，就变得没有自信了，怕被嫌弃，怕对方不把自己放在眼里。</p><p>真正的爱情，会让人成熟，也会让人幼稚。它有很大的力量，总是把你往前推，不会让你停止脚步，直到你成功了，它才会给你放个小长假，让你好好休息。</p><p>心里装满了你，最怕的一件事就是你离开。每天早上睁开眼，会第一时间找你，只有看见你他才会安心，每天晚上刚进家门，他就会喊一句“我回来了”，听到你的声音他才会放心。</p><p>拥有了你，他才品尝到爱情的甜蜜，你给他带来了不一样的感觉，他怎么能不珍惜你呢？男人害怕失去你，才会这么“折磨”你。</p><p>你走到哪里，他就会跟到哪里</p><p>有很多女人，和男人确定关系后，会变得很粘人。喜欢依靠在男人的臂膀上，喜欢冲着男人傻傻的笑着，喜欢和男人聊未来的生活。</p><p>男人真正爱上了女人，也会变成这个样子。每天都会接女人上下班，女人去逛街，去参加聚会的时候，男人都会跟在身后。</p><p>因为爱你，所以会把时间都留给你，因为爱你，所以会守护在你的身后。不管他忙与不忙，不管他心情好与坏，他对你都是很热情的。</p><p>你不喜欢过于粘人的男人，你很想把他推开，在这个时候，你要站在他的角度想一想。他是最爱你的人，别等失去了才知道后悔。</p><p>删除所有异性，只能和他靠近</p><p>朋友是不分性别的，有男也有女。一个人的时候，你是自由的，不管你和谁走得近，都不会有人阻止你，因为这是你的事，和别人没有任何关系。</p><p>恋爱以后就会有人管着你了，你的事情他会参与，你和别人多说一句话都是不可以的。很多时候，你都感觉到后面有两只眼睛在盯着你呢。</p><p>每一个人都想有一点自由空间，但爱情里是没有自由的。你成为了他的人，你的每件事情都和他有密切联系，他怎么可能对你不管不问呢？</p><p>男人允许你走进他的生活里，就意味着认准你了，早晚都会把你娶回家。没有人想把自己的“未婚妻”弄丢了，所以，他会把你看得紧紧的。</p><p>变得很幼稚，总故意惹你生气</p><p>真心爱你的男人，很想融进你的生活里，很想成为你生命中不可缺少的一部分。他害怕失去你，他想让你像他一样，也害怕失去他。</p><p>在外人面前，他是很高冷的，不会多和别人说一句话，在你面前，他像变了一个人一样，会说个不停，还会一直对着你傻笑。</p><p>为了让你多留意他，他像个小孩子，故意惹你生气。被人忽略，心里很不是滋味，和谁在一起就要在谁的身上多花一些时间，他是你的爱人，不是普通朋友。</p><p>不愿结束聊天，一直和你聊着</p><p>我们永远都不知道明天与意外哪个先来，所以我们会珍惜每一个今天。有很多人，都在第二天早上睁开眼的那一刻失去了所有。</p><p>没有金钱，是不行的，没有爱人，也是不行的。在他的心里，你是最重要的，他宁愿失去所拥有的一切，也不愿失去你。一想到没有你的日子，他的心就会很痛，要是真的失去你了，他的心会碎一地。</p><p>不想和你分开，不想和你成为陌生人，不想再也看不见你。除了工作，他会一直和你聊着，即使困得不行，也不想说“晚安”。</p><p>虽然说，他这样做，是有些自私，没有考虑你的感受，但他全都是为了能和你一直在一起。不要责怪男人，不要不理男人，多想想他对你的好。</p><p><b>情感寄语：</b></p><p>爱得越深，越会胡思乱想，越会自己吓唬自己。很多时候，不想让自己想这么多，可根本管不住自己。</p><p>女人要知道，男人这样“折磨”你，是爱到了最高境界，是奔着和你一辈子去的。</p><p>被男人深爱着，是多么幸运的一件事。所以说，不要去责怪男人，要懂得珍惜他，要一直和他在一起。</p><p>-END-</p>"
			},
			{
				"id": 2,
				"title": "深入理解 Java 反射和动态代理",
				"content": "<h2>简介</h2><h3>什么是反射</h3><p>反射(Reflection)是 Java 程序开发语言的特征之一，它允许运行中的 Java 程序获取自身的信息，并且可以操作类或对象的内部属性。</p><p><strong>通过反射机制，可以在运行时访问 Java 对象的属性，方法，构造方法等。</strong></p><h3>反射的应用场景</h3><p>反射的主要应用场景有：</p><ul><li><strong>开发通用框架</strong> - 反射最重要的用途就是开发各种通用框架。很多框架（比如 Spring）都是配置化的（比如通过 XML 文件配置 JavaBean、Filter 等），为了保证框架的通用性，它们可能需要根据配置文件加载不同的对象或类，调用不同的方法，这个时候就必须用到反射——运行时动态加载需要加载的对象。</li><li><strong>动态代理</strong> - 在切面编程（AOP）中，需要拦截特定的方法，通常，会选择动态代理方式。这时，就需要反射技术来实现了。</li><li><strong>注解</strong> - 注解本身仅仅是起到标记作用，它需要利用反射机制，根据注解标记去调用注解解释器，执行行为。如果没有反射机制，注解并不比注释更有用。</li><li><strong>可扩展性功能</strong> - 应用程序可以通过使用完全限定名称创建可扩展性对象实例来使用外部的用户定义类。</li></ul><h3>反射的缺点</h3><ul><li><strong>性能开销</strong> - 由于反射涉及动态解析的类型，因此无法执行某些 Java虚拟机优化。因此，反射操作的性能要比非反射操作的性能要差，应该在性能敏感的应用程序中频繁调用的代码段中避免。</li><li><strong>破坏封装性</strong> - 反射调用方法时可以忽略权限检查，因此可能会破坏封装性而导致安全问题。</li><li><strong>内部曝光</strong> -由于反射允许代码执行在非反射代码中非法的操作，例如访问私有字段和方法，所以反射的使用可能会导致意想不到的副作用，这可能会导致代码功能失常并可能破坏可移植性。反射代码打破了抽象，因此可能会随着平台的升级而改变行为。</li></ul>"
			},
			{
				"id": 3,
				"title": "高情商的27个小细节，你占了几个？",
				"content": "<p><b>1、把自己要说的“不对”统统改成了“对”——不会直接否定对方，而是先肯定对方再提出自己的见解。<br>2、说谢谢的时侯，常加上“你”，或者加上对方的名字。<br>3、请别人帮忙的时侯，句子末尾会加上“好吗”。<br>4、聊天的时候，很少用我，而多说你。<br>5、喜欢用“我们”、“咱们”，从而迅速拉近关系<br>6、赞美别人的时侯，不空泛，而是具体地赞美细节。<br>7、赞美别人鲜为人知的优点，赞美他期待被夸奖的部分。<br>8、当面说对方的坏话，背后说他的好话——要知道你背后说的坏话早晚会传到对方的耳朵里，只是时间问题。<br>9、尊重朋友——你可以嘲笑你的朋友，但不可以嘲笑他喜欢的东西，尤其不要嘲笑他的偶像。10、初次见面，努力记住别人的名字。<br>11、撕逼再激烈，再愤怒，也不说真正伤害对方自尊的话。<br>即使是对最熟悉、最亲切的人，依然保持尊重和耐心。<br>12、做到真性情——真性情是让你说真话，不是让你说难听的话。<br>13、看破，但不点破，给别人留一点余地。<br>14、社交场合中，考虑少数派的感受。<br>15、如果一定要炫耀，会加上自己的糗事中和一下。<br>16、把“你明白我的意思吗”换成“我说清楚了吗”。17、把心里的小猥琐说出来——有时候把自己难受的点说出来，会更讨喜。<br>18、用有趣的方式自嘲，成为自己的高端黑。<br>19、在安慰别人的时候，适当说点自己悲惨的事，让他治愈一下。<br>20、不说“我早就告诉你了”，“我就知道会这样”。<br>21、聊天的时候，如果对方被打断了，会问一句：刚才你要说什么？<br>22、不在每一场谈话都挣输赢——你赢了道理，可能会输了感情。23、如果聊到吃的话题，会记住对方爱吃什么。<br>24、分享荣耀的时候，提到别人。承担责任的时候，提到自己。<br>25、不大发飙——胡适说，发怒是一种破相。<br>26、拒绝别人之前，先自责。<br>27、寻求合作的时候，不总说自己想要什么，而说能给对方什么。</b></p>"
			},
			{
				"id": 4,
				"title": "如何用手账打造你的超强行动力（一）",
				"content": "<p>1、手账的来源</p><p>很多人喜欢手账，想要学习关于手账的知识，那么到底什么是“手账”呢？“手帐”一词来源于日本，翻译过来就是笔记本的意思。在日本大部分人都会随身带着一个被称为“手账”的笔记本，随时随地掏出来翻翻看，或者不断记录一些重要的信息。据说，“手帐”在明治时代就已经出现。它最早是为政府和军队官员特别设计的，作为“行程记录本”供他们使用。从历史我们可以了解到“手帐”最初的目的就是为了让大家规划自己的工作、生活乃至人生，演化到现在，“手账”类型已然非常丰富了。比如日程规划、备忘录、美食记录、电影手账、旅行手账、家书手账等等，每个人都可以根据自己的需要写属于自己的手账。那么，简而言之“手账”就是整理、规划自己生活的特殊的笔记本。</p>"
			},
			{
				"id": 5,
				"title": "大专程序员质问马云：你说招聘从不看文凭，为何我投阿里石沉大海",
				"content": "<p>在互联网职业分享社区，一名大专程序员对马云发出了质问：你说招聘从不看文凭，为啥我投阿里的简历石沉大海，我同学浙大投了马上就有面试？很显然，这名大专生认为阿里招聘还是看学历和文凭的。</p><p>不过马上就有网友站出来反驳：马云说他不看，不是招聘不看，抛去学历，你确定你比你同学强？你觉得跟他的差别只在一纸文凭吗；招聘有成本的，学历高的人能力强的概率大很多，你是hr你也会这么干，不然要累死；你没有过人之处的话凭什么要你，好大学出身的话起码证明底子不差；你要真有能力，就写份求职信给马云，哪怕公开的也行，没有的话，就别较真这个，没学历的要比高学历的更有能力，才会被注意到，这个道理明白吧！如果都一样，费什么劲头考清华北大？你当人家白考的？你当人家的努力白费？</p>"
			},
			{
				"id": 6,
				"title": "世界播放量最高的10首歌曲，第一名有60亿的播放量",
				"content": "<p>本期给大家推荐的是YouTube播放最高的十首MV，听过8首以上就是资深的音乐迷了，如果有喜欢的小伙伴喜欢的话可以话可以加个关注，也可以在评论区和小编交流你喜欢的歌曲，还可以分享收藏。</p><p><b>NO.10 Ed Sheeran《Think Out Loud》</b></p><p>这首歌累积播放量26.8亿次，并在2016年2月获得了低58届格莱美年度单曲奖。歌曲讲述的是情侣之间相爱永远，相伴到永久的浪漫歌谣，相比于黄老板其他歌曲，这首歌的声音更加细腻柔软，而各种微小的背景音乐又将他温柔的声音衬托了出来。</p><p><b>NO.9 Taylor Swift 《Shake it off》</b></p><p>累积播放量27.48亿次，这首歌收录在第五张专辑《1989》作为首支单曲发行第一周下载量高达54.4万，是2014年周销量最高的单曲。这首歌的MV视觉效果怪异，多种风格混搭，霉霉表演频频搞怪，给大家带来极大的震撼，欢快的节奏和霉霉之前乡村路线还是相差较大。</p><p><b>NO.8 Katy Perry《Roar》</b></p><p>累积播放量27.57亿次。水果姐的第八支冠军单曲，这首歌在发行以后登顶了十多个国家的排行榜，《Roar》以强力流行乐为主，同时融入了迷幻摇滚和舞台摇滚的元素，对于歌词而言则是给人以励志作用，配上歌曲欢快的旋律，让听歌的人产生极大的共鸣。</p><p><b>NO.7 Maroon 5 《Sugar》</b></p><p>累积播放量29亿，这是魔力红2015年的歌曲，这首歌的MV是在2015年1月14日发行，MV的创意是来自于2005年大卫道金执导的《婚礼傲客》，当魔力红乐队来到婚礼现场，白幕落下音乐响起时，婚礼现场顿时沸腾，随着磁性的音乐尽情舞动，享受爱情的甜蜜。</p><p><b>NO.6 &nbsp;Justin Bieber 《Sorry》</b></p><p>累积播放量30.92亿次，这首作为美国公告牌百强单曲榜上的第二支冠军单曲，在2016年1月23日拿下榜单首位并且连续登顶3周，在MV中出演的人物是一个新西兰舞蹈团队组合，高潮电音旋律一出，女孩们的身体就像是通上了电流一般，色调明亮、气氛欢快，女孩们跳舞的姿态颇为惹眼。</p><p><b>NO.5 Psy 《江南Style》韩语：강남 스타일</b></p><p>累积播放量32.98亿次，鸟叔2012年的歌曲。对比歌词，网友们感兴趣的则是MV里PSY独创的“骑马舞”：身形偏胖的PSY，不断重复着扬鞭套马、策马狂奔的动作和耍贱的表情，配上音乐节奏，让人莫名就有了跟着一起舞蹈的冲动。这也正是从明星到草根都趋之若鹜进行模仿的段落。就和《最炫民族风》一样，简单的入门拥有良好的群众基础。</p><p><b>NO.4 Bruno Mars《Uptown Funk》</b></p><p>&#8203;累积播放量34.78亿次。在2016年2月16日，获得第58届格莱美音乐奖年度制作奖，马尔斯和马克凭借这首歌获得最佳流行组合奖。火星大仙一副俏皮浪荡样子，加上骚气十足的舞步，这首歌是火星哥在公告牌百强单曲榜冠军时间最长的单曲。该首歌曲共连续卫冕14周公告牌百强单曲榜冠军，历史排名第二。</p><p><b>NO.3&nbsp;Wiz Khalifa/Charlie Puth《See you again》</b></p><p>累积播放量40.24亿次。作为《速度与激情7》的主题曲和片尾曲。2015年4月6日正式发布歌曲的MV，由MarcKlasfeld执导拍摄。MV中有维兹·卡利法与查理·普斯两人的演唱画面，并穿插保罗·沃克在该系列电影的片段。MV的最后，由保罗·沃克饰演的Brian O'Conner和范·迪塞尔饰演的DominicToretto相视一笑，驶向两条不同的道路。</p><p>NO.2 Ed Sheeran 《Shape of you》</p><p>累积播放量40.99亿次。这是黄老板的公告牌首支单曲，在2017年1月28日拿下排行版榜首，公告牌百强单曲榜上的第27支“首周冠军单曲“，这首歌共拿下12周冠军。简单循环踏板的背景旋律，成功将现代流行音乐重组。歌曲的开头采用了马林巴琴的可爱声响，同时讲述了一段爱情的萌芽过程。歌曲施展温柔抒情路线，递送出艾德·希兰最擅长的婉约风格，并突显出其创作力的强劲。</p><p><b>NO.1 《Despactio》</b></p><p>《Despacito》是路易斯·冯西、洋基老爹合唱的歌曲，由艾瑞卡·安德、路易斯·冯西、洋基老爹共同创作，单曲发行于2017年1月13日，收录于路易斯·冯西的第五张精选专辑《Despacito &amp; MisGrandes Éxitos（缓慢我的精选辑）》中。加拿大男歌手贾斯汀·比伯参与的英文混音版《Despacito》于2017年4月17日发行。华语男歌手林俊杰参与的中文版《缓缓》于2018年1月26日发行。2017年2月18日，该曲获得美国公告牌热门拉丁歌曲排行榜冠军。2017年11月16日，该曲获得拉丁格莱美奖年度制作、年度歌曲和最佳短篇音乐录影带奖。</p>"
			}
		]
	}
}